## House Price Prediction :

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv(r"C:\Users\admin\Desktop\ML-BHARAT INTERNSHIP\Bengaluru_House_Data.csv")

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df = df.rename(columns={"bath": "bathroom"})

In [5]:
df.shape

(13320, 9)

In [6]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bathroom', 'balcony', 'price'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bathroom      13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [8]:
df.describe()

           bathroom       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [9]:
df.dtypes

area_type        object
availability     object
location         object
size             object
society          object
total_sqft       object
bathroom        float64
balcony         float64
price           float64
dtype: object

In [10]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bathroom          73
balcony          609
price              0
dtype: int64

In [11]:
for column in df.columns:
	print(df[column].value_counts())
	print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
********************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bathroom, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
********************

In [12]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bathroom          73
balcony          609
price              0
dtype: int64

In [13]:
df.drop(columns=['area_type', 'availability','society','balcony'],inplace=True)

In [14]:
df.describe()

           bathroom         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bathroom    13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [16]:
df['location'].ffill(inplace=True)

In [17]:
df['size'].ffill(inplace=True)

In [18]:
df['bathroom'] = df['bathroom'].fillna(df['bathroom'].median())

In [19]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bathroom      0
price         0
dtype: int64

In [20]:
# checking for duplicates
df.duplicated()
df.duplicated().value_counts()

False    12438
True       882
dtype: int64

In [21]:
df = df.drop_duplicates()

In [22]:
df.head()

                   location       size total_sqft  bathroom   price
0  Electronic City Phase II      2 BHK       1056       2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600       5.0  120.00
2               Uttarahalli      3 BHK       1440       2.0   62.00
3        Lingadheeranahalli      3 BHK       1521       3.0   95.00
4                  Kothanur      2 BHK       1200       2.0   51.00

In [23]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [24]:
df['total_sqft']=df['total_sqft'].apply(convertRange)

In [25]:
df['price_per_sqft'] = df['price'] *100000 / df['total_sqft']

In [26]:
df.head()

,location,size,total_sqft,bathroom,price,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,4250.000000

In [27]:
df['size'] = df['size'].str.strip('BHK')
df['size'] = df['size'].str.strip('Bedroom')
df['size'] = df['size'].str.strip('R')

In [28]:
df['location'] = df['location'].apply(lambda x: x.strip())
location_counts= df['location'].value_counts()

In [29]:
location_counts

Whitefield                               508
Sarjapur  Road                           365
Electronic City                          275
Thanisandra                              226
Kanakpura Road                           223
                                        ...
Ring Road Nagarbhavi                       1
Mango Garden Layout                        1
Vijayabank bank layout                     1
Bidere Agarahara, Behind Safal market      1
Abshot Layout                              1
Name: location, Length: 1294, dtype: int64

In [30]:
location_count_less_10 = location_counts[location_counts<=10]
location_count_less_10

Sadashiva Nagar                          10
Gunjur Palya                             10
BEML Layout                              10
Ganga Nagar                              10
ITPL                                     10
                                         ..
Ring Road Nagarbhavi                      1
Mango Garden Layout                       1
Vijayabank bank layout                    1
Bidere Agarahara, Behind Safal market     1
Abshot Layout                             1
Name: location, Length: 1063, dtype: int64

In [31]:
df['location']=df['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [32]:
df['location'].value_counts()

other                   2927
Whitefield               508
Sarjapur  Road           365
Electronic City          275
Thanisandra              226
                        ...
Banashankari Stage V      11
Doddakallasandra          11
Kodigehalli               11
NGR Layout                11
LB Shastri Nagar          11
Name: location, Length: 232, dtype: int64

In [33]:
df.head()

                   location size  total_sqft  bathroom   price  price_per_sqft
0  Electronic City Phase II   2       1056.0       2.0   39.07     3699.810606
1          Chikka Tirupathi   4       2600.0       5.0  120.00     4615.384615
2               Uttarahalli   3       1440.0       2.0   62.00     4305.555556
3        Lingadheeranahalli   3       1521.0       3.0   95.00     6245.890861
4                  Kothanur   2       1200.0       2.0   51.00     4250.000000

In [34]:
df['size'] = df['size'].astype(int)

In [35]:
(df['total_sqft']/df['size']).describe()

count    12392.000000
mean       577.102094
std        401.821582
min          0.250000
25%        473.458333
50%        552.500000
75%        627.500000
max      26136.000000
dtype: float64

In [36]:
df = df[((df['total_sqft']/df['size']) >= 300)]
df.describe()

               size    total_sqft      bathroom         price  price_per_sqft
count  11663.000000  11663.000000  11663.000000  11663.000000    11663.000000
mean       2.667838   1614.165987      2.579268    114.375806     6396.938444
std        0.995325   1298.811881      1.098496    156.556442     4266.671906
min        1.000000    300.000000      1.000000      8.440000      267.829813
25%        2.000000   1120.000000      2.000000     50.000000     4255.319149
50%        3.000000   1310.000000      2.000000     70.500000     5346.315789
75%        3.000000   1724.000000      3.000000    120.000000     6998.190161
max       16.000000  52272.000000     16.000000   3600.000000   176470.588235

In [37]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)

        st = np.std(subdf.price_per_sqft)

        gen_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
df = remove_outliers_sqft(df)
df.describe()

              size    total_sqft     bathroom        price  price_per_sqft
count  9606.000000   9606.000000  9606.000000  9606.000000     9606.000000
mean      2.588695   1526.760657     2.491880    93.577278     5732.509016
std       0.915250    907.245415     1.003423    88.815235     2296.835776
min       1.000000    300.000000     1.000000    10.000000     1250.000000
25%       2.000000   1108.000000     2.000000    50.000000     4285.714286
50%       2.000000   1300.000000     2.000000    68.280000     5219.780220
75%       3.000000   1671.500000     3.000000   103.000000     6510.700772
max      16.000000  30400.000000    16.000000  2200.000000    24509.803922

In [38]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        size_stats = {}
        for size, size_df in location_df.groupby('size'):
            size_stats[size] = {
                     'mean': np.mean(size_df.price_per_sqft),
                     'std': np.std(size_df.price_per_sqft),
                     'count': size_df.shape[0] }
        
        for size, size_df in location_df.groupby('size'):
            stats = size_stats.get(size-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, size_df[size_df.price_per_sqft<(stats['mean'])].index. values)
    return df.drop(exclude_indices, axis="index")

In [39]:
df.shape

(9606, 6)

In [40]:
df.drop('price_per_sqft', axis=1, inplace=True)

In [41]:
df.head()

              location  size  total_sqft  bathroom  price
0  1st Block Jayanagar     4      2850.0       4.0  428.0
1  1st Block Jayanagar     3      1630.0       3.0  194.0
2  1st Block Jayanagar     3      1875.0       2.0  235.0
3  1st Block Jayanagar     3      1200.0       2.0  130.0
4  1st Block Jayanagar     2      1235.0       2.0  148.0

In [42]:
df.to_csv("Cleaned_data.csv")

In [43]:
df=pd.read_csv('Cleaned_data.csv')

In [44]:
df.head()

   Unnamed: 0             location  size  total_sqft  bathroom  price
0           0  1st Block Jayanagar     4      2850.0       4.0  428.0
1           1  1st Block Jayanagar     3      1630.0       3.0  194.0
2           2  1st Block Jayanagar     3      1875.0       2.0  235.0
3           3  1st Block Jayanagar     3      1200.0       2.0  130.0
4           4  1st Block Jayanagar     2      1235.0       2.0  148.0

In [45]:
from sklearn.model_selection import train_test_split

# Data Preparation and Modelling
 Have a look at the steps that are followed:

* Identifying the inputs (X) and output (y)
* Split into train and test
* Preprocess the training data
* Preprocess the test data

In [46]:
df.columns

Index(['Unnamed: 0', 'location', 'size', 'total_sqft', 'bathroom', 'price'], dtype='object')

In [47]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [48]:
X=df.drop(columns=['price'])
y=df['price']

In [49]:
y.head()

0    428.0
1    194.0
2    235.0
3    130.0
4    148.0
Name: price, dtype: float64

In [50]:
X.head()

              location  size  total_sqft  bathroom
0  1st Block Jayanagar     4      2850.0       4.0
1  1st Block Jayanagar     3      1630.0       3.0
2  1st Block Jayanagar     3      1875.0       2.0
3  1st Block Jayanagar     3      1200.0       2.0
4  1st Block Jayanagar     2      1235.0       2.0

In [51]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import f1_score
from sklearn.compose import make_column_transformer
from sklearn.metrics import r2_score

from sklearn.metrics import mean_absolute_error
from sklearn.tree import DecisionTreeRegressor

In [52]:
X_train, X_test, y_train,y_test = train_test_split(X, y,test_size=0.2, random_state=0)

print(X_train.shape, X_test.shape)
print(y_train.shape, y_test.shape)

(7684, 4) (1922, 4)
(7684,) (1922,)

# Seperate the Categorial and Numerical Columns:

In [53]:
X_train_cat = X_train.select_dtypes(include=['object'])

X_train_cat.head()

                location
2943  Horamavu Banaswadi
9281               other
8658               other
989           Begur Road
9490               other

In [54]:
X_train_num = X_train.select_dtypes(include=['float64','int64'])

X_train_num.head()

      size  total_sqft  bathroom
2943     2      1000.0       2.0
9281     2      1090.0       2.0
8658     3      1410.0       2.0
989      2       952.0       2.0
9490     2      1290.0       2.0

In [55]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']), remainder="passthrough")

In [56]:
scaler = StandardScaler()
lr = LinearRegression()
dr=Lasso()
pipe = make_pipeline(column_trans,scaler,lr)

In [57]:
pipe.fit(X_train,y_train)

C:\ProgramData\anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:828: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression())])

In [58]:
y_pred = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred)

0.7931772892059108

In [60]:
import pickle

In [61]:
pickle.dump(pipe,open('Hp_prediction_LR.pkl','wb'))